/* automatically generated by rust-bindgen 0.65.1 */

pub const SECP256K1_FLAGS_TYPE_MASK: u32 = 255;
pub const SECP256K1_FLAGS_TYPE_CONTEXT: u32 = 1;
pub const SECP256K1_FLAGS_TYPE_COMPRESSION: u32 = 2;
pub const SECP256K1_FLAGS_BIT_CONTEXT_VERIFY: u32 = 256;
pub const SECP256K1_FLAGS_BIT_CONTEXT_SIGN: u32 = 512;
pub const SECP256K1_FLAGS_BIT_CONTEXT_DECLASSIFY: u32 = 1024;
pub const SECP256K1_FLAGS_BIT_COMPRESSION: u32 = 256;
pub const SECP256K1_CONTEXT_NONE: u32 = 1;
pub const SECP256K1_CONTEXT_VERIFY: u32 = 257;
pub const SECP256K1_CONTEXT_SIGN: u32 = 513;
pub const SECP256K1_CONTEXT_DECLASSIFY: u32 = 1025;
pub const SECP256K1_EC_COMPRESSED: u32 = 258;
pub const SECP256K1_EC_UNCOMPRESSED: u32 = 2;
pub const SECP256K1_TAG_PUBKEY_EVEN: u32 = 2;
pub const SECP256K1_TAG_PUBKEY_ODD: u32 = 3;
pub const SECP256K1_TAG_PUBKEY_UNCOMPRESSED: u32 = 4;
pub const SECP256K1_TAG_PUBKEY_HYBRID_EVEN: u32 = 6;
pub const SECP256K1_TAG_PUBKEY_HYBRID_ODD: u32 = 7;
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct secp256k1_context_struct {
    _unused: [u8; 0],
}
#[doc = " Opaque data structure that holds context information\n\n  The primary purpose of context objects is to store randomization data for\n  enhanced protection against side-channel leakage. This protection is only\n  effective if the context is randomized after its creation. See\n  secp256k1_context_create for creation of contexts and\n  secp256k1_context_randomize for randomization.\n\n  A secondary purpose of context objects is to store pointers to callback\n  functions that the library will call when certain error states arise. See\n  secp256k1_context_set_error_callback as well as\n  secp256k1_context_set_illegal_callback for details. Future library versions\n  may use context objects for additional purposes.\n\n  A constructed context can safely be used from multiple threads\n  simultaneously, but API calls that take a non-const pointer to a context\n  need exclusive access to it. In particular this is the case for\n  secp256k1_context_destroy, secp256k1_context_preallocated_destroy,\n  and secp256k1_context_randomize.\n\n  Regarding randomization, either do it once at creation time (in which case\n  you do not need any locking for the other calls), or use a read-write lock."]
pub type secp256k1_context = secp256k1_context_struct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct secp256k1_scratch_space_struct {
    _unused: [u8; 0],
}
#[doc = " Opaque data structure that holds rewritable \"scratch space\"\n\n  The purpose of this structure is to replace dynamic memory allocations,\n  because we target architectures where this may not be available. It is\n  essentially a resizable (within specified parameters) block of bytes,\n  which is initially created either by memory allocation or TODO as a pointer\n  into some fixed rewritable space.\n\n  Unlike the context object, this cannot safely be shared between threads\n  without additional synchronization logic."]
pub type secp256k1_scratch_space = secp256k1_scratch_space_struct;
#[doc = " Opaque data structure that holds a parsed and valid public key.\n\n  The exact representation of data inside is implementation defined and not\n  guaranteed to be portable between different platforms or versions. It is\n  however guaranteed to be 64 bytes in size, and can be safely copied/moved.\n  If you need to convert to a format suitable for storage or transmission,\n  use secp256k1_ec_pubkey_serialize and secp256k1_ec_pubkey_parse. To\n  compare keys, use secp256k1_ec_pubkey_cmp."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct secp256k1_pubkey {
    pub data: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_secp256k1_pubkey() {
    const UNINIT: ::std::mem::MaybeUninit<secp256k1_pubkey> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<secp256k1_pubkey>(),
        64usize,
        concat!("Size of: ", stringify!(secp256k1_pubkey))
    );
    assert_eq!(
        ::std::mem::align_of::<secp256k1_pubkey>(),
        1usize,
        concat!("Alignment of ", stringify!(secp256k1_pubkey))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(secp256k1_pubkey),
            "::",
            stringify!(data)
        )
    );
}
#[doc = " Opaque data structured that holds a parsed ECDSA signature.\n\n  The exact representation of data inside is implementation defined and not\n  guaranteed to be portable between different platforms or versions. It is\n  however guaranteed to be 64 bytes in size, and can be safely copied/moved.\n  If you need to convert to a format suitable for storage, transmission, or\n  comparison, use the secp256k1_ecdsa_signature_serialize_* and\n  secp256k1_ecdsa_signature_parse_* functions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct secp256k1_ecdsa_signature {
    pub data: [::std::os::raw::c_uchar; 64usize],
}
#[test]
fn bindgen_test_layout_secp256k1_ecdsa_signature() {
    const UNINIT: ::std::mem::MaybeUninit<secp256k1_ecdsa_signature> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<secp256k1_ecdsa_signature>(),
        64usize,
        concat!("Size of: ", stringify!(secp256k1_ecdsa_signature))
    );
    assert_eq!(
        ::std::mem::align_of::<secp256k1_ecdsa_signature>(),
        1usize,
        concat!("Alignment of ", stringify!(secp256k1_ecdsa_signature))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(secp256k1_ecdsa_signature),
            "::",
            stringify!(data)
        )
    );
}
